apache-jmeter/plan/test.yml
---
execution:
  concurrency: 10
  ramp-up: 1m
  hold-for: 1m30s

  scenario:
    think-time: 0.75
    requests:
      - http://blazedemo.com/
      - http://blazedemo.com/vacation.html

modules:
  jmeter:
    properties:
      jmeter.save.saveservice.output_format: xml      
  blazemeter:
    browser-open: false
    token: 53669adc226f75ba341e
  console:
    disable: true
  consolidator:
    generalize-labels: false
reporting:
  - module: blazemeter
    test: Test Jenkins + Taurus + Blazemeter
  - module: console
  - module: junit-xml
    filename: ./junit.xml
    data-source: pass-fail
  - module: fail-criteria
    criterias:
    - avg-rt>120s for 30s, continue as failed
    - fail>10% for 10s, continue as failed